tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "sqlite"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "python@3.13"
brew "cmake"
brew "cocoapods"
brew "docker"
brew "docker-compose"
brew "fastlane"
brew "fd"
brew "fzf"
brew "gh"
brew "ghc"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "lua"
brew "neovim"
brew "node"
brew "nowplaying-cli"
brew "nvm"
brew "openjdk"
brew "postgresql@14"
brew "postgresql@15"
brew "pyenv"
brew "python@3.9"
brew "r"
brew "ripgrep"
brew "switchaudio-osx"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "adobe-acrobat-pro"
cask "adobe-creative-cloud"
cask "android-studio"
cask "cabal"
cask "caffeine"
cask "discord"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "lark"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "mongodb-compass"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "postman-cli"
cask "rstudio"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "steam"
cask "tableau"
cask "wacom-tablet"
cask "wechat"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "deanin.tailwind-fold-rails"
vscode "esbenp.prettier-vscode"
vscode "haskell.haskell"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "justusadam.language-haskell"
vscode "miguelsolorio.fluent-icons"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rvest.vs-code-prettier-eslint"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "stivo.tailwind-fold"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
